app/controllers/admin/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    @categories = Category.all.paginate :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `categories`
---
  def new
    @category = Category.new
    @categories = Category.all - [@category]

INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `parent_id`) VALUES('name_4', '2010-10-10 13:25:13', '2010-10-10 13:25:13', NULL)
SELECT * FROM `categories`
---
  def create
    @category = Category.new(params[:category])
    if @category.save
      flash[:notice] = "Successfully Created"
      redirect_to new_admin_category_url
    else
      @categories = Category.all - [@category]

SELECT * FROM `categories` WHERE (`categories`.`id` = 4)
SELECT * FROM `categories`
---
  def edit
    @category = Category.find(params[:id])
    @categories = Category.all - [@category]

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
UPDATE `categories` SET `updated_at` = '2010-10-10 13:25:13', `name` = 'updated name' WHERE `id` = 2
SELECT * FROM `categories`
---
  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])
      flash[:notice] = "Successfully Updated"
      redirect_to admin_categories_url
    else
      @categories = Category.all - [@category]

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1
---
  def destroy
    @category = Category.find(params[:id])
    unless @category.destroy