app/controllers/admin/products_controller.rb

  def new
    @categories = Category.all
---
SELECT * FROM `categories`

  def create
    @product = Product.new(params[:product])
    if @product.save
      flash[:notice] = "Successfully Created"
      redirect_to new_admin_product_url
    else
      @categories = Category.all
---
INSERT INTO `products` (`name`, `price`, `created_at`, `additional_information`, `updated_at`, `category_id`, `description`, `visible`) VALUES('name_20', NULL, '2010-10-10 15:54:37', NULL, '2010-10-10 15:54:37', 15, 'Description of the product', 0)
SELECT * FROM `categories`

  def edit
    @categories = Category.all
    @product = Product.find(params[:id])
---
SELECT * FROM `categories`
SELECT * FROM `products` WHERE (`products`.`id` = 4)

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])
      flash[:notice] = "Successfully Updated"
      redirect_to admin_products_url
    else
      @categories = Category.all
---
SELECT * FROM `products` WHERE (`products`.`id` = 2)
UPDATE `products` SET `updated_at` = '2010-10-10 13:25:13', `name` = 'updated name' WHERE `id` = 2
SELECT * FROM `categories`