app/controllers/admin/users_controller.rb

UPDATE `users` SET `updated_at` = '2010-10-01 03:35:41', `crypted_password` = '138fbbcb0699bd61b0fa55503ce1a578856cf5bc8dac38339d8f78a116a65f5f9e3b3de5b47e0f3f334f6db5aeb84b3b379e26919f8b2539d03c5fe0207c1a9a', `password_salt` = '6ZoxUbZsHZSjr4aBWOu7', `persistence_token` = '98d7f7ff666ff70ad0c4c8e11f35d0cf7fc9ededcdf914ac287646a03657da9f49fcb2f94912e680a295a11972db9e5f8ced8bc49fbbe6cc6de5771bd9c612bc' WHERE `id` = 2
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])