app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE (`categories`.parent_id = 7)
---
  def show
    @category = Category.find(params[:id],:include => :children)